#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-WNQxvjwaoD6QEyKU

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=0035f2a418841c5fc85e85e43105b01c64b6894d]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=mc44y9]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=oj6t4a]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration has been deleted
  - resource "aws_api_gateway_integration" "agencies_lambda_integration" {
      - cache_namespace         = "udh18b" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-8hbmj9nmrj-udh18b-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_templates       = {
          - "application/xml" = <<-EOT
                {
                      "body" : $input.json('$'),
                      "environment": "$stageVariables.environment"
                    }
            EOT
        } -> null
      - resource_id             = "udh18b" -> null
      - rest_api_id             = "8hbmj9nmrj" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:agencies_lambda/invocations" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_prod_deployment" {
      ~ created_date  = "2023-06-27T05:32:40Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "mc44y9" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "363d027c29e5fbcc47511b7e13c16badaaf4d04f"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_test_deployment" {
      ~ created_date  = "2023-06-27T05:32:42Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "oj6t4a" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "363d027c29e5fbcc47511b7e13c16badaaf4d04f"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration will be created
  + resource "aws_api_gateway_integration" "agencies_lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/xml" = <<-EOT
                {
                      "body" : $input.json('$'),
                      "environment": "$stageVariables.environment"
                    }
            EOT
        }
      + resource_id             = "udh18b"
      + rest_api_id             = "8hbmj9nmrj"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:914036813947:function:agencies_lambda/invocations"
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "mc44y9" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.test will be updated in-place
  ~ resource "aws_api_gateway_stage" "test" {
      ~ deployment_id         = "oj6t4a" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*